export default {
    // 系统
    400000: {
        code: 400000,
        msg: '未知错误'
    },
    // 权限问题
    411001: {
        code: 411001,
        msg: '登录失效'
    },
    411002: {
        code: 411002,
        msg: '未登录'
    },
    411003: {
        code: 411003,
        msg: '没有访问权限'
    },
    // 用户注册
    401001: {
        code: 401001,
        msg: '邮箱不能为空'
    },
    401002: {
        code: 401002,
        msg: '名字不能为空'
    },
    401003: {
        code: 401003,
        msg: '密码至少八位'
    },
    401004: {
        code: 401004,
        msg: '该名字已存在'
    },
    401005: {
        code: 401005,
        msg: '邮箱格式不正确'
    },
    401006: {
        code: 401006,
        msg: '该邮箱已存在'
    },
    // 用户登录
    401011: {
        code: 401011,
        msg: '请输入账户'
    },
    401012: {
        code: 401012,
        msg: '该用户不存在'
    },
    401013: {
        code: 401013,
        msg: '该邮箱不存在'
    },
    401014: {
        code: 401014,
        msg: '密码不正确'
    },
    // 创建分类
    401021: {
        code: 401021,
        msg: '分类已存在'
    },
    401022: {
        code: 401022,
        msg: '父分类不存在'
    },
    // 帖子

    // 评论
    401041: {
        code: 401041,
        msg: '父评论不存在'
    }
    
}